In [1]:
import numpy as np
import pandas as pd

In [2]:
s1 = pd.Series([4, 7, -5, 3])
print(s1)

0    4
1    7
2   -5
3    3
dtype: int64

In [3]:
s1.values

array([ 4,  7, -5,  3])

In [4]:
s1.index

RangeIndex(start=0, stop=4, step=1)

In [5]:
s2 = pd.Series([4.0, 6.5, -0.5, 4.2], index=['d', 'b', 'a', 'c'])
s2

d    4.0
b    6.5
a   -0.5
c    4.2
dtype: float64

In [6]:
 s2['a']   # 根据索引取值

-0.5

In [7]:
s2[['a', 'b', 'c']]    # 根据索引列表取值

a   -0.5
b    6.5
c    4.2
dtype: float64

In [8]:
'b' in s2

True

In [9]:
'e' in s2

False

In [10]:
# Series 可以看成是一个定长的有序字典
dict1 = {'apple' : 5, 'pen' : 3, 'applepen' : 10}
s3 = pd.Series(dict1)
s3

apple        5
pen          3
applepen    10
dtype: int64

In [12]:
data = {
    'year': [2014, 2015, 2016, 2017],
    'income': [10000, 30000, 50000, 80000],
    'pay': [5000, 20000, 30000, 300000]
}
df1 = pd.DataFrame(data)
df1

   year  income     pay
0  2014   10000    5000
1  2015   30000   20000
2  2016   50000   30000
3  2017   80000  300000

In [16]:
df1.columns

Index(['year', 'income', 'pay'], dtype='object')

In [17]:
df1.index

RangeIndex(start=0, stop=4, step=1)

In [19]:
df1.T

            0      1      2       3
year     2014   2015   2016    2017
income  10000  30000  50000   80000
pay      5000  20000  30000  300000

In [18]:
df1.describe()

              year        income            pay
count     4.000000      4.000000       4.000000
mean   2015.500000  42500.000000   88750.000000
std       1.290994  29860.788112  141207.589503
min    2014.000000  10000.000000    5000.000000
25%    2014.750000  25000.000000   16250.000000
50%    2015.500000  40000.000000   25000.000000
75%    2016.250000  57500.000000   97500.000000
max    2017.000000  80000.000000  300000.000000

In [13]:
df2 = pd.DataFrame(np.arange(12).reshape((3,4)))
df2

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [15]:
df3 = pd.DataFrame(np.arange(12).reshape((3,4)), index=['a', 'c', 'b'], columns=[2, 33, 44, 5])
df3

   2   33  44  5
a   0   1   2   3
c   4   5   6   7
b   8   9  10  11

In [20]:
df3.sort_index(axis=1)    # axis=1 对列进行排序

   2   5   33  44
a   0   3   1   2
c   4   7   5   6
b   8  11   9  10

In [21]:
df3.sort_index(axis=0)    # axis=0 对行进行排序

   2   33  44  5
a   0   1   2   3
b   8   9  10  11
c   4   5   6   7

In [22]:
df3.sort_values(by=44)    # 对 columns=44 进行排序

   2   33  44  5
a   0   1   2   3
c   4   5   6   7
b   8   9  10  11